-- phpMyAdmin SQL Dump
-- version 5.1.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Dec 20, 2024 at 01:05 PM
-- Server version: 5.7.24
-- PHP Version: 8.3.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `backoffice`
--

-- --------------------------------------------------------

--
-- Table structure for table `sale_product_pipelines`
--

CREATE TABLE `sale_product_pipelines` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `sale_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `category_id` int(11) DEFAULT NULL,
  `target` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `q1` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `q2` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `q3` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `q4` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `date` date DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sale_product_pipelines`
--

INSERT INTO `sale_product_pipelines` (`id`, `user_id`, `sale_name`, `category_id`, `target`, `q1`, `q2`, `q3`, `q4`, `date`, `created_at`, `updated_at`) VALUES
(1, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 1, NULL, '30000.00', '30000.00', '30000.00', '30000.00', '2024-12-09', '2024-12-08 11:40:08', '2024-12-08 11:40:08'),
(2, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 2, NULL, '2850000.00', '2850000.00', '2850000.00', '2850000.00', '2024-12-09', '2024-12-08 11:40:08', '2024-12-08 11:40:08'),
(3, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 3, NULL, '2550000.00', '2550000.00', '2550000.00', '2550000.00', '2024-12-09', '2024-12-08 11:44:40', '2024-12-08 11:44:40'),
(4, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:44:40', '2024-12-08 11:44:40'),
(5, NULL, 'คุณสุพัตรา  ถาลี', 1, NULL, '1200000.00', '1200000.00', '1200000.00', '1200000.00', '2024-12-09', '2024-12-08 11:47:14', '2024-12-08 11:47:14'),
(6, NULL, 'คุณสุพัตรา  ถาลี', 2, NULL, '60000.00', '60000.00', '60000.00', '60000.00', '2024-12-09', '2024-12-08 11:47:14', '2024-12-08 11:47:14'),
(7, NULL, 'คุณสุพัตรา  ถาลี', 3, NULL, '120000.00', '120000.00', '120000.00', '120000.00', '2024-12-09', '2024-12-08 11:48:55', '2024-12-08 11:48:55'),
(8, NULL, 'คุณสุพัตรา  ถาลี', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:48:55', '2024-12-08 11:48:55'),
(9, NULL, 'คุณวุฒิชัย สารยศ', 1, NULL, '2356500.00', '2356500.00', '2356500.00', '2356500.00', '2024-12-09', '2024-12-08 11:51:35', '2024-12-08 11:51:35'),
(10, NULL, 'คุณวุฒิชัย สารยศ', 2, NULL, '112500.00', '112500.00', '112500.00', '112500.00', '2024-12-09', '2024-12-08 11:51:35', '2024-12-08 11:51:35'),
(11, NULL, 'คุณวุฒิชัย สารยศ', 3, NULL, '337500.00', '337500.00', '337500.00', '337500.00', '2024-12-09', '2024-12-08 11:53:24', '2024-12-08 11:53:24'),
(12, NULL, 'คุณวุฒิชัย สารยศ', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:53:24', '2024-12-08 11:53:24'),
(13, NULL, 'คุณเสาวนีย์  แย้มคง', 1, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:55:33', '2024-12-08 11:55:33'),
(14, NULL, 'คุณเสาวนีย์  แย้มคง', 2, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:55:33', '2024-12-08 11:55:33'),
(15, NULL, 'คุณเสาวนีย์  แย้มคง', 3, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:56:25', '2024-12-08 11:56:25'),
(16, NULL, 'คุณเสาวนีย์  แย้มคง', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:56:25', '2024-12-08 11:56:25'),
(17, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 1, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:57:54', '2024-12-08 11:57:54'),
(18, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 2, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:57:54', '2024-12-08 11:57:54'),
(19, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 3, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:58:50', '2024-12-08 11:58:50'),
(20, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:58:50', '2024-12-08 11:58:50'),
(21, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 1, NULL, '435000.00', '510500.00', '13500.00', '13500.00', '2025-12-09', '2024-12-08 11:40:08', '2024-12-08 11:40:08'),
(22, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 2, NULL, '4629593.00', '6959186.00', '2309000.00', '4473593.00', '2025-12-09', '2024-12-08 11:40:08', '2024-12-08 11:40:08'),
(23, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 3, NULL, '2448300.00', '3764000.00', '21000.00', '1021000.00', '2025-12-09', '2024-12-08 11:44:40', '2024-12-08 11:44:40'),
(24, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2025-12-09', '2024-12-08 11:44:40', '2024-12-08 11:44:40'),
(25, NULL, 'คุณสุพัตรา  ถาลี', 1, NULL, '1574610.90', '515257.85', '2549600.00', '944400.00', '2025-12-09', '2024-12-08 11:47:14', '2024-12-08 11:47:14'),
(26, NULL, 'คุณสุพัตรา  ถาลี', 2, NULL, '1304353.00', '15000.00', '53000.00', '15000.00', '2025-12-09', '2024-12-08 11:47:14', '2024-12-08 11:47:14'),
(27, NULL, 'คุณสุพัตรา  ถาลี', 3, NULL, '294050.00', '70000.00', '268500.00', '0.00', '2025-12-09', '2024-12-08 11:48:55', '2024-12-08 11:48:55'),
(28, NULL, 'คุณสุพัตรา  ถาลี', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2025-12-09', '2024-12-08 11:48:55', '2024-12-08 11:48:55'),
(29, NULL, 'คุณวุฒิชัย สารยศ', 1, NULL, ' 1,187,400.00 \n', ' 173,500.00 \n', ' 4,703,400.00 \n', ' 7,725,899.37 \n', '2025-12-09', '2024-12-08 11:51:35', '2024-12-08 11:51:35'),
(30, NULL, 'คุณวุฒิชัย สารยศ', 2, NULL, ' 205,650.00 \n', ' 84,000.00 \n', ' 558,250.00 \n', ' 2,597,650.00 \n', '2025-12-09', '2024-12-08 11:51:35', '2024-12-08 11:51:35'),
(31, NULL, 'คุณวุฒิชัย สารยศ', 3, NULL, ' 123,233.50 \n', ' 288,400.00 \n', ' 4,695,750.00 \n', ' 2,726,250.00 \n', '2025-12-09', '2024-12-08 11:53:24', '2024-12-08 11:53:24'),
(32, NULL, 'คุณวุฒิชัย สารยศ', 4, NULL, '0.00', '0.00', '0.00', ' 778,612.00 \n', '2025-12-09', '2024-12-08 11:53:24', '2024-12-08 11:53:24'),
(33, NULL, 'คุณเสาวนีย์  แย้มคง', 1, NULL, ' 18,874,319.31 \n', ' 7,455,337.50 \n', ' 1,600,206.25 \n', ' 10,104,517.50 \n', '2025-12-09', '2024-12-08 11:55:33', '2024-12-08 11:55:33'),
(34, NULL, 'คุณเสาวนีย์  แย้มคง', 2, NULL, ' 8,111,323.62 \n', ' 8,446,323.62 \n', ' 8,111,323.62 \n', ' 8,111,323.62 \n', '2025-12-09', '2024-12-08 11:55:33', '2024-12-08 11:55:33'),
(35, NULL, 'คุณเสาวนีย์  แย้มคง', 3, NULL, ' 185,700.00 \n', ' 730,700.00 \n', ' 185,700.00 \n', ' 185,700.00 \n', '2025-12-09', '2024-12-08 11:56:25', '2024-12-08 11:56:25'),
(36, NULL, 'คุณเสาวนีย์  แย้มคง', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2025-12-09', '2024-12-08 11:56:25', '2024-12-08 11:56:25'),
(37, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 1, NULL, '0.00', '0.00', '0.00', '0.00', '2025-12-09', '2024-12-08 11:57:54', '2024-12-08 11:57:54'),
(38, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 2, NULL, ' 8,500,000.00 \n', '8500000.00', '8500000.00', '8500000.00', '2025-12-09', '2024-12-08 11:57:54', '2024-12-08 11:57:54'),
(39, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 3, NULL, ' 12,948,000.00 \n', ' 14,257,920.00 \n', ' 14,257,920.00 \n', ' 14,257,920.00 \n', '2025-12-09', '2024-12-08 11:58:50', '2024-12-08 11:58:50'),
(40, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 4, NULL, ' 8,500,000.00 \n', ' 8,000,000.00 \n', ' 17,000,000.00 \n', ' 17,000,000.00 \n', '2025-12-09', '2024-12-08 11:58:50', '2024-12-08 11:58:50');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `sale_product_pipelines`
--
ALTER TABLE `sale_product_pipelines`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `sale_product_pipelines`
--
ALTER TABLE `sale_product_pipelines`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
