-- phpMyAdmin SQL Dump
-- version 5.1.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Dec 20, 2024 at 01:05 PM
-- Server version: 5.7.24
-- PHP Version: 8.3.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `backoffice`
--

-- --------------------------------------------------------

--
-- Table structure for table `sale_product_targets`
--

CREATE TABLE `sale_product_targets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `sale_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `category_id` int(11) DEFAULT NULL,
  `target` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `q1` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `q2` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `q3` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `q4` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `date` date DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sale_product_targets`
--

INSERT INTO `sale_product_targets` (`id`, `user_id`, `sale_name`, `category_id`, `target`, `q1`, `q2`, `q3`, `q4`, `date`, `created_at`, `updated_at`) VALUES
(1, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 1, NULL, '30000.00', '30000.00', '30000.00', '30000.00', '2024-12-09', '2024-12-08 11:40:08', '2024-12-08 11:40:08'),
(2, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 2, NULL, '2850000.00', '2850000.00', '2850000.00', '2850000.00', '2024-12-09', '2024-12-08 11:40:08', '2024-12-08 11:40:08'),
(3, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 3, NULL, '2550000.00', '2550000.00', '2550000.00', '2550000.00', '2024-12-09', '2024-12-08 11:44:40', '2024-12-08 11:44:40'),
(4, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:44:40', '2024-12-08 11:44:40'),
(5, NULL, 'คุณสุพัตรา  ถาลี', 1, NULL, '1200000.00', '1200000.00', '1200000.00', '1200000.00', '2024-12-09', '2024-12-08 11:47:14', '2024-12-08 11:47:14'),
(6, NULL, 'คุณสุพัตรา  ถาลี', 2, NULL, '60000.00', '60000.00', '60000.00', '60000.00', '2024-12-09', '2024-12-08 11:47:14', '2024-12-08 11:47:14'),
(7, NULL, 'คุณสุพัตรา  ถาลี', 3, NULL, '120000.00', '120000.00', '120000.00', '120000.00', '2024-12-09', '2024-12-08 11:48:55', '2024-12-08 11:48:55'),
(8, NULL, 'คุณสุพัตรา  ถาลี', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:48:55', '2024-12-08 11:48:55'),
(9, NULL, 'คุณวุฒิชัย สารยศ', 1, NULL, '2356500.00', '2356500.00', '2356500.00', '2356500.00', '2024-12-09', '2024-12-08 11:51:35', '2024-12-08 11:51:35'),
(10, NULL, 'คุณวุฒิชัย สารยศ', 2, NULL, '112500.00', '112500.00', '112500.00', '112500.00', '2024-12-09', '2024-12-08 11:51:35', '2024-12-08 11:51:35'),
(11, NULL, 'คุณวุฒิชัย สารยศ', 3, NULL, '337500.00', '337500.00', '337500.00', '337500.00', '2024-12-09', '2024-12-08 11:53:24', '2024-12-08 11:53:24'),
(12, NULL, 'คุณวุฒิชัย สารยศ', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:53:24', '2024-12-08 11:53:24'),
(13, NULL, 'คุณเสาวนีย์  แย้มคง', 1, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:55:33', '2024-12-08 11:55:33'),
(14, NULL, 'คุณเสาวนีย์  แย้มคง', 2, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:55:33', '2024-12-08 11:55:33'),
(15, NULL, 'คุณเสาวนีย์  แย้มคง', 3, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:56:25', '2024-12-08 11:56:25'),
(16, NULL, 'คุณเสาวนีย์  แย้มคง', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:56:25', '2024-12-08 11:56:25'),
(17, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 1, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:57:54', '2024-12-08 11:57:54'),
(18, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 2, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:57:54', '2024-12-08 11:57:54'),
(19, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 3, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:58:50', '2024-12-08 11:58:50'),
(20, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2024-12-09', '2024-12-08 11:58:50', '2024-12-08 11:58:50'),
(21, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 2, NULL, '230000.00', '230000.00', '220000.00', '220000.00', '2025-12-09', '2024-12-08 11:40:08', '2024-12-08 11:40:08'),
(22, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 2, NULL, '3700000.00', '3700000.00', '3800000.00', '3800000.00', '2025-12-09', '2024-12-08 11:40:08', '2024-12-08 11:40:08'),
(23, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 3, NULL, '1800000.00', '1800000.00', '1700000.00', '1700000.00', '2025-12-09', '2024-12-08 11:44:40', '2024-12-08 11:44:40'),
(24, NULL, 'คุณกฤตณัฐ  ปัญจรัตน์', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2025-12-09', '2024-12-08 11:44:40', '2024-12-08 11:44:40'),
(25, NULL, 'คุณสุพัตรา  ถาลี', 1, NULL, '1200000.00', '1200000.00', '1350000.00', '1350000.00', '2025-12-09', '2024-12-08 11:47:14', '2024-12-08 11:47:14'),
(26, NULL, 'คุณสุพัตรา  ถาลี', 2, NULL, '200000.00', '200000.00', '30000.00', '30000.00', '2025-12-09', '2024-12-08 11:47:14', '2024-12-08 11:47:14'),
(27, NULL, 'คุณสุพัตรา  ถาลี', 3, NULL, '125000.00', '125000.00', '125000.00', '125000.00', '2025-12-09', '2024-12-08 11:48:55', '2024-12-08 11:48:55'),
(28, NULL, 'คุณสุพัตรา  ถาลี', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2025-12-09', '2024-12-08 11:48:55', '2024-12-08 11:48:55'),
(29, NULL, 'คุณวุฒิชัย สารยศ', 1, NULL, '3000000.00', '3000000.00', '3500000.00', '3500000.00', '2025-12-09', '2024-12-08 11:51:35', '2024-12-08 11:51:35'),
(30, NULL, 'คุณวุฒิชัย สารยศ', 2, NULL, '750000.00', '750000.00', '750000.00', '750000.00', '2025-12-09', '2024-12-08 11:51:35', '2024-12-08 11:51:35'),
(31, NULL, 'คุณวุฒิชัย สารยศ', 3, NULL, '1700000.00', '1700000.00', '1550000.00', '1550000.00', '2025-12-09', '2024-12-08 11:53:24', '2024-12-08 11:53:24'),
(32, NULL, 'คุณวุฒิชัย สารยศ', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2025-12-09', '2024-12-08 11:53:24', '2024-12-08 11:53:24'),
(33, NULL, 'คุณเสาวนีย์  แย้มคง', 1, NULL, '9000000.00', '9000000.00', '9000000.00', '9000000.00', '2025-12-09', '2024-12-08 11:55:33', '2024-12-08 11:55:33'),
(34, NULL, 'คุณเสาวนีย์  แย้มคง', 2, NULL, '8000000.00', '8000000.00', '8000000.00', '8000000.00', '2025-12-09', '2024-12-08 11:55:33', '2024-12-08 11:55:33'),
(35, NULL, 'คุณเสาวนีย์  แย้มคง', 3, NULL, '250000.00', '250000.00', '250000.00', '250000.00', '2025-12-09', '2024-12-08 11:56:25', '2024-12-08 11:56:25'),
(36, NULL, 'คุณเสาวนีย์  แย้มคง', 4, NULL, '0.00', '0.00', '0.00', '0.00', '2025-12-09', '2024-12-08 11:56:25', '2024-12-08 11:56:25'),
(37, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 1, NULL, '0.00', '0.00', '0.00', '0.00', '2025-12-09', '2024-12-08 11:57:54', '2024-12-08 11:57:54'),
(38, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 2, NULL, '8500000.00', '8500000.00', '8500000.00', '8500000.00', '2025-12-09', '2024-12-08 11:57:54', '2024-12-08 11:57:54'),
(39, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 3, NULL, '14000000.00', '14000000.00', '13500000.00', '13500000.00', '2025-12-09', '2024-12-08 11:58:50', '2024-12-08 11:58:50'),
(40, NULL, 'คุณวิษณุพงษ์  วงศ์วาสน์', 4, NULL, '12500000.00', '12500000.00', '12500000.00', '12500000.00', '2025-12-09', '2024-12-08 11:58:50', '2024-12-08 11:58:50');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `sale_product_targets`
--
ALTER TABLE `sale_product_targets`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `sale_product_targets`
--
ALTER TABLE `sale_product_targets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
