<?php

return [

    'profile'               => 'ข้อมูลส่วนบุคคล',
    'logout'                => 'ออกจากระบบ',
    'login'                 => 'เข้าสู่ระบบ',
    'login_to'              => 'เข้าสู่ระบบเพื่อเริ่มต้นเซสชันของคุณ',
    'remember_me'           => 'บันทึกการใช้งานของฉัน',
    'forgot_password'       => 'ฉันลืมรหัสผ่าน',
    'reset_password'        => 'ตั้งรหัสผ่านใหม่',
    'enter_email'           => 'ใส่อีเมลของคุณ',
    'current_email'         => 'อีเมลปัจจุบัน',
    'reset'                 => 'ตั้งค่าใหม่',
    'never'                 => 'ไม่เคยเลย',
    'landing_page'          => 'หน้าเริ่มต้น',
    'email'                 => 'อีเมล',
    'send_email'            => 'ส่งอีเมล',
    'or'                    => 'หรือ',
    'you_don_have_account'  => 'ไม่มีบัญชี?',
    'register'              => 'ลงทะเบียน',
    'already_have_account'  => 'คุณมีบัญชีอยู่แล้ว?',
    'enter_register'        => 'กรอกอีเมลและรหัสผ่านของคุณเพื่อลงทะเบียน',
    'name'                  => 'ชื่อ-นามสกุล',
    'enter_name'            => 'กรอกชื่อ-นามสกุล',
    'lock_screen'          => 'ล็อคหน้าจอ',
    'unlock'               => 'ปลดล็อค',
    'enter_to_unlock'      => 'กรอกรหัสผ่านเพื่อปลดล็อค ID ของคุณ',
    'support'              => 'สนับสนุน',

    'password' => [
        'current'           => 'รหัสผ่าน',
        'current_confirm'   => 'ยืนยันรหัสผ่าน',
        'new'               => 'รหัสผ่านใหม่',
        'new_confirm'       => 'ยืนยันรหัสผ่านใหม่',
        'enter'             => 'ใส่รหัสผ่านของคุณ',
    ],

    'error' => [
        'self_delete'       => 'ข้อผิดพลาด: ไม่สามารถลบด้วยตัวคุณเองได้!',
        'self_disable'      => 'ข้อผิดพลาด: ไม่สามารถปิดการใช้งานบัญชีคุณเองได้!',
        'no_company'        => 'ข้อผิดพลาด: บัญชีของคุณยังไม่ได้ตั้งค่าบริษัท กรุณา ติดต่อผู้ดูแลระบบ',
        'incorrect'         => 'อีเมลหรือรหัสผ่านไม่ถูกต้อง',
        'disabled'          => 'บัญชีของคุณไม่มีสิทธิเข้าใช้งาน กรุณาติดต่อผู้ดูแลระบบ',
        'error'             => 'ข้อผิดพลาด!',
    ],

    'failed'                => 'ข้อมูลที่ใช้ในการยืนยันตัวตนไม่ถูกต้อง',
    'throttle'              => 'คุณได้พยายามเข้าระบบหลายครั้งเกินไป กรุณาลองใหม่ใน :seconds วินาทีข้างหน้า.',
    'disabled'              => 'บัญชีนี้ถูกปิดใช้งาน กรุณา ติดต่อผู้ดูแลระบบ',

    'notification' => [
        'message_1'     => 'คุณได้รับอีเมลนี้เนื่องจากเราได้รับการร้องขอรีเซ็ตรหัสผ่านสำหรับบัญชีของคุณ',
        'message_2'     => 'ถ้าคุณไม่ได้ขอรีเซ็ตรหัสผ่าน ไม่จำเป็นต้องทำอะไรเพิ่มเติม',
        'button'        => 'ตั้งรหัสผ่านใหม่',
    ],

];
