<?php

return [

    'domain'                => 'โดเมน',
    'logo'                  => 'โลโก้',
    'country'               => 'ประเทศ',

    'currency' => [
        'currency'  => 'สกุลเงิน',
        "USD" => "ดอลลาร์สหรัฐ ($)",
        "EUR" => "ยูโร (€)",
        "JPY" => "เยนญี่ปุ่น (¥)",
        "GBP" => "ปอนด์สเตอร์ลิงอังกฤษ (£)",
        "AUD" => "ดอลลาร์ออสเตรเลีย (A$)",
        "CAD" => "ดอลลาร์แคนาดา (C$)",
        "CHF" => "ฟรังก์สวิส (CHF)",
        "CNY" => "หยวนจีน (¥)",
        "SEK" => "โครนา สวีเดน (kr)",
        "NZD" => "ดอลลาร์นิวซีแลนด์ (NZ$)",
        "MXN" => "เปโซเม็กซิโก (MX$)",
        "SGD" => "ดอลลาร์สิงคโปร์ (S$)",
        "HKD" => "ดอลลาร์ฮ่องกง (HK$)",
        "NOK" => "โครนนอร์เวย์ (kr)",
        "KRW" => "วอนเกาหลีใต้ (₩)",
        "TRY" => "ลีราตุรกี (₺)",
        "RUB" => "รูเบิลรัสเซีย (₽)",
        "INR" => "รูปีอินเดีย (₹)",
        "BRL" => "เรียลบราซิล (R$)",
        "ZAR" => "แรนด์แอฟริกาใต้ (R)",
        "PHP" => "เปโซฟิลิปปินส์ (₱)",
        "IDR" => "รูเปียห์อินโดนีเซีย (Rp)",
        "THB" => "บาทไทย (฿)",
        "MYR" => "ริงกิตมาเลเซีย (RM)",
        "VND" => "ดองเวียดนาม (₫)",
        "AED" => "ดีแรห์มสหรัฐอาหรับเอมิเรตส์ (د.إ)",
        "SAR" => "ริยัลซาอุดีอาระเบีย (﷼)",
        "PLN" => "ซวอตีโปแลนด์ (zł)",
        "CZK" => "โครูนาสาธารณรัฐเช็ก (Kč)",
        "HUF" => "โฟรินต์ฮังการี (Ft)",
        "DKK" => "โครนเดนมาร์ก (kr)",
        "ILS" => "นิวเชเกลอิสราเอล (₪)",
        "CLP" => "เปโซชิลี (CLP$)",
        "COP" => "เปโซโคลอมเบีย (COP$)",
        "ARS" => "เปโซอาร์เจนตินา (ARS$)",
        "EGP" => "ปอนด์อียิปต์ (£)",
        "PKR" => "รูปีปากีสถาน (₨)",
        "BDT" => "ตากาบังกลาเทศ (৳)"
    ],

    'error' => [
        'not_user_company'  => 'ข้อผิดพลาด: คุณไม่สามารถแก้ไขบริษัทนี้!',
        'delete_active'     => 'ข้อผิดพลาด: ไม่สามารถลบบริษัทที่กำลังดำเนินการอยู่ได้ โปรดเปลี่ยนบริษัทอื่นก่อน!',
        'disable_active'    => 'ข้อผิดพลาด: ไม่สามารถปิดการใช้งานบริษัทที่กำลังดำเนินการอยู่ได้ โปรดเปลี่ยนบริษัทอื่นก่อน!',
    ],

];
