<?php

return [

    'title' => [
        '401' => 'ขออภัย ไม่ได้รับอนุญาต',
        '403' => 'ขออภัย ระบบไม่อนุญาตให้เข้าได้',
        '404' => 'ขออภัย ระบบไม่พบหน้านี้',
        '429' => 'ขออภัย คำขอมากเกินไป',
        '500' => 'ขออภัย มีบางอย่างผิดพลาด',
        '503' => 'ขออภัย บริการไม่พร้อมใช้งาน',
        '419' => 'ขออภัย หน้าหมดอายุแล้ว',
    ],

    'header' => [
        '401' => '401 คุณไม่ได้รับอนุญาต',
        '403' => '403 ไม่อนุญาต',
        '404' => '404 ไม่พบ',
        '429' => '429 ข้อผิดพลาดการร้องขอมากเกินไป',
        '500' => '500 ข้อผิดพลาดภายในเซิร์ฟเวอร์',
        '503' => '503 บริการไม่พร้อมใช้งาน',
        '419' => '419 หน้าหมดอายุแล้ว',
    ],

    'message' => [
        '401' => 'คุณไม่ได้รับอนุญาต',
        '403' => 'คุณไม่มีสิทธิเข้าถึงหน้านี้',
        '404' => 'เราไม่พบหน้าที่คุณกำลังหาอยู่',
        '429' => 'ข้อผิดพลาดการร้องขอมากเกินไป',
        '500' => 'เราจะดำเนินการแก้ไขภายในเร็วๆนี้',
        '503' => 'บริการไม่พร้อมใช้งาน',
        '419' => 'หน้าหมดอายุแล้ว',
    ],

    'button' => [
        'home' => 'กลับสู่หน้าหลัก',
    ],

];
