<?php

return [

    'seconds_ago'             => 'วินาทีที่แล้ว',
    'one_minute_ago'          => 'เมื่อหนึ่งนาทีที่แล้ว',
    'minutes_ago'             => 'นาทีที่ผ่านมา',
    'an_hour_ago'             => 'เมื่อหนึ่งชั่วโมงที่แล้ว',
    'hours_ago'               => 'ชั่วโมงที่ผ่านมา',
    'yesterday'               => 'เมื่อวาน',
    'days_ago'                => 'วันที่ผ่านมา',
    'a_week_ago'              => 'เมื่อสัปดาห์ที่แล้ว',
    'weeks_ago'               => 'สัปดาห์ที่ผ่านมา',
    'a_month_ago'             => 'เมื่อหนึ่งเดือนที่แล้ว',
    'months_ago'              => 'เดือนที่ผ่านมา',
    'one_year_ago'            => 'เมื่อหนึ่งปีที่แล้ว',
    'years_ago'               => 'ปีที่ผ่านมา',

];
